app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $allCategories = Category::with('parentCategory', 'childrenCategories.categories')->get();
---
select * from `categories`