app/Http/Controllers/Admin/ProductController.php

    public function index()
    {
        // $products = Cache::remember('products', now()->addMinutes(10), function () {
        //     return Product::with('variants', 'variants.prices', 'categories')->orderBy('id', 'desc')->get()->values();;
        // });
        $products = Product::with('variants', 'productImage', 'variants.prices', 'categories')->get();
---
select * from `products`
select `categories`.*, `product_categories`.`product_id` as `pivot_product_id`, `product_categories`.`category_id` as `pivot_category_id` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` in (1, 2, 3, 4, 5, 6)

    public function create()
    {
        $categories = Category::where('parent_id', 0)
            ->with('childrenCategories')
            ->select('id', 'name')->get();
        $brands = Brand::where('status', 1)->select('id', 'name')->get();
        $units = Unit::where('status', 1)->select('id', 'name', 'short_name')->get();
        $variants = Variant::with('variantValues')->get();
---
select `id`, `name` from `brands` where `status` = 1
select `id`, `name`, `short_name` from `units` where `status` = 1
select `id`, `name` from `categories`
select * from `variant_values` where `variant_values`.`variant_id` in (47, 48)
select * from `variants`